# Project 3: 

#### By Billy Cole

Creating a set pandaframe from of the Chinook SQL db. Let's start by importing the necesary libraries.

In [3]:
import pandas as pd
import numpy as np
import sqlite3
from sqlalchemy import create_engine

#### Create a Data Frame:

So the required information to display is their name, purchased track and album titles.

In [14]:
sql = '''SELECT c.LastName, c.FirstName, i.InvoiceId, il.InvoiceId, t.Name, a.Title
         FROM Customer as c
         INNER JOIN Invoice as i
         ON c.CustomerId = i.CustomerId
         INNER JOIN InvoiceLine as il
         ON i.InvoiceId = il.InvoiceId
         INNER JOIN Track as t
         ON il.TrackId = t.TrackId
         INNER JOIN Album as a
         ON t.AlbumId = a.AlbumId
         ORDER BY c.LastName, c.FirstName'''

db = sqlite3.connect('/Users/williamcole/IS362_Spring_2017/Project_3/ChinookDatabase1.4_CompleteVersion/Chinook_Sqlite.sqlite')
pd.read_sql_query(sql, db).head(5)

,LastName,FirstName,InvoiceId,InvoiceId,Name,Title
0,Almeida,Roberto,34,34,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,155,155,In The Evening,In Through The Out Door
2,Almeida,Roberto,155,155,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,166,166,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,166,166,Caso Você Queira Saber,Minas